{"377":{"Abstract":"In this paper we present World Lines as a novel interactive visualization that provides complete control over multiple heterogeneous simulation runs. In many application areas, decisions can only be made by exploring alternative scenarios. The goal of the suggested approach is to support users in this decision making process. In this setting, the data domain is extended to a set of alternative worlds where only one outcome will actually happen. World Lines integrate simulation, visualization and computational steering into a single unified system that is capable of dealing with the extended solution space. World Lines represent simulation runs as causally connected tracks that share a common time axis. This setup enables users to interfere and add new information quickly. A World Line is introduced as a visual combination of user events and their effects in order to present a possible future. To quickly find the most attractive outcome, we suggest World Lines as the governing component in a system of multiple linked views and a simulation component. World Lines employ linking and brushing to enable comparative visual analysis of multiple simulations in linked views. Analysis results can be mapped to various visual variables that World Lines provide in order to highlight the most compelling solutions. To demonstrate this technique we present a flooding scenario and show the usefulness of the integrated approach to support informed decision making.","Authors":"Waser, J.;Fuchs, R.;Ribicic, H.;Schindler, B.;Bloschl, G.;Groller, E.","Clusters":"ApplicationsGeneralAndOther;FlowVisualizationDataAndTechniques;ParticleVisualizationAndTechniques;ReasoningProblemSolvingAndDecisionMaking;Simulation","DOI":"10.1109\/TVCG.2010.223","Keywords":"decision making;simulation steering;computational fluid dynamics;smoothed particle hydrodynamics;parallel worlds;problem solving environments","Keywords_Processed":"simulation steering;decision make;smoothed particle hydrodynamic;problem solve environment;computational fluid dynamic;parallel world","Title":"World Lines"},"201":{"Abstract":"The relationship between candidates' position on a ballot paper and vote rank is explored in the case of 5000 candidates for the UK 2010 local government elections in the Greater London area. This design study uses hierarchical spatially arranged graphics to represent two locations that affect candidates at very different scales: the geographical areas for which they seek election and the spatial location of their names on the ballot paper. This approach allows the effect of position bias to be assessed; that is, the degree to which the position of a candidate's name on the ballot paper influences the number of votes received by the candidate, and whether this varies geographically. Results show that position bias was significant enough to influence rank order of candidates, and in the case of many marginal electoral wards, to influence who was elected to government. Position bias was observed most strongly for Liberal Democrat candidates but present for all major political parties. Visual analysis of classification of candidate names by ethnicity suggests that this too had an effect on votes received by candidates, in some cases overcoming alphabetic name bias. The results found contradict some earlier research suggesting that alphabetic name bias was not sufficiently significant to affect electoral outcome and add new evidence for the geographic and ethnicity influences on voting behaviour. The visual approach proposed here can be applied to a wider range of electoral data and the patterns identified and hypotheses derived from them could have significant implications for the design of ballot papers and the conduct of fair elections.","Authors":"Wood, J.;Badawood, D.;Dykes, J.;Slingsby, A.","Clusters":"ApplicationsGeneralAndOther;Cognition;GeographyGeospatialVisCartographyTerrainVis;HierarchicalTreeDataAndTechniques;SocialScienceAndHumanities","DOI":"10.1109\/TVCG.2011.174","Keywords":"democracy;hierarchy;election;bias;treemap;governance;voting;geovisualization","Keywords_Processed":"hierarchy;treemap;governance;election;democracy;geovisualization;bias;voting","Title":"BallotMaps: Detecting Name Bias in Alphabetically Ordered Ballot Papers"},"169":{"Abstract":"Lighting design is a complex, but fundamental, problem in many fields. In volume visualization, direct volume rendering generates an informative image without external lighting, as each voxel itself emits radiance. However, external lighting further improves the shape and detail perception of features, and it also determines the effectiveness of the communication of feature information. The human visual system is highly effective in extracting structural information from images, and to assist it further, this paper presents an approach to structure-aware automatic lighting design by measuring the structural changes between the images with and without external lighting. Given a transfer function and a viewpoint, the optimal lighting parameters are those that provide the greatest enhancement to structural information - the shape and detail information of features are conveyed most clearly by the optimal lighting parameters. Besides lighting goodness, the proposed metric can also be used to evaluate lighting similarity and stability between two sets of lighting parameters. Lighting similarity can be used to optimize the selection of multiple light sources so that different light sources can reveal distinct structural information. Our experiments with several volume data sets demonstrate the effectiveness of the structure-aware lighting design approach. It is well suited to use by novices as it requires little technical understanding of the rendering parameters associated with direct volume rendering.","Authors":"Yubo Tao;Hai Lin;Feng Dong;Chao Wang;Clapworthy, G.;Hujun Bao","Clusters":"ComparisonComparativeVisualizationAndSimilarity;Illumination;VolumeRenderingModelingAndVisualization","DOI":"10.1109\/TVCG.2012.267","Keywords":"structural dissimilarity;lighting similarity;volume rendering;lighting stability;automatic lighting design","Keywords_Processed":"volume render;structural dissimilarity;light stability;lighting similarity;automatic lighting design","Title":"Structure-Aware Lighting Design for Volume Visualization"},"45":{"Abstract":"Rankings are a popular and universal approach to structuring otherwise unorganized collections of items by computing a rank for each item based on the value of one or more of its attributes. This allows us, for example, to prioritize tasks or to evaluate the performance of products relative to each other. While the visualization of a ranking itself is straightforward, its interpretation is not, because the rank of an item represents only a summary of a potentially complicated relationship between its attributes and those of the other items. It is also common that alternative rankings exist which need to be compared and analyzed to gain insight into how multiple heterogeneous attributes affect the rankings. Advanced visual exploration tools are needed to make this process efficient. In this paper we present a comprehensive analysis of requirements for the visualization of multi-attribute rankings. Based on these considerations, we propose LineUp - a novel and scalable visualization technique that uses bar charts. This interactive technique supports the ranking of items based on multiple heterogeneous attributes with different scales and semantics. It enables users to interactively combine attributes and flexibly refine parameters to explore the effect of changes in the attribute combination. This process can be employed to derive actionable insights as to which attributes of an item need to be modified in order for its rank to change. Additionally, through integration of slope graphs, LineUp can also be used to compare multiple alternative rankings on the same set of items, for example, over time or across different attribute combinations. We evaluate the effectiveness of the proposed multi-attribute visualization technique in a qualitative study. The study shows that users are able to successfully solve complex ranking tasks in a short period of time.","Authors":"Gratzl, S.;Lex, A.;Gehlenborg, N.;Pfister, H.;Streit, M.","Clusters":"ChartsDiagramsPlots;DataFacetsAndTechniques;EvaluationGeneral;InteractionTechniquesGeneral;MultidimensionalMultivariateMultifieldDataAndTechniques;Ranking","DOI":"10.1109\/TVCG.2013.173","Keywords":"ranking;stacked bar charts;scoring;multi-factorial;multi-attribute;multi-faceted;ranking visualization","Keywords_Processed":"multi factorial;multi attribute;score;rank;stack bar chart;multi faceted;rank visualization","Title":"LineUp: Visual Analysis of Multi-Attribute Rankings"},"284":{"Abstract":"Visual analysis is widely used to study the behavior of molecules. Of particular interest are the analysis of molecular interactions and the investigation of binding sites. For large molecules, however, it is difficult to detect possible binding sites and paths leading to these sites by pure visual inspection. In this paper, we present new methods for the computation and visualization of potential molecular paths. Using a novel filtering method, we extract the significant paths from the Voronoi diagram of spheres. For the interactive visualization of molecules and their paths, we present several methods using deferred shading and other state-of-theart techniques. To allow for a fast overview of reachable regions of the molecule, we illuminate the molecular surface using a large number of light sources placed on the extracted paths. We also provide a method to compute the extension surface of selected paths and visualize it using the skin surface. Furthermore, we use the extension surface to clip the molecule to allow easy visual tracking of even deeply buried paths. The methods are applied to several proteins to demonstrate their usefulness.","Authors":"Lindow, N.;Baum, D.;Hege, H.-C.","Clusters":"FilteringTechniques;GeometryBasedTechniques;MolecularScienceAndChemistry;ViewDependentVisualization","DOI":"10.1109\/TVCG.2011.259","Keywords":"data filtering;view-dependent visualization;molecular visualization;geometry-based technique","Keywords_Processed":"datum filtering;molecular visualization;geometry base technique;view dependent visualization","Title":"Voronoi-Based Extraction and Visualization of Molecular Paths"},"236":{"Abstract":"Image analysis algorithms are often highly parameterized and much human input is needed to optimize parameter settings. This incurs a time cost of up to several days. We analyze and characterize the conventional parameter optimization process for image analysis and formulate user requirements. With this as input, we propose a change in paradigm by optimizing parameters based on parameter sampling and interactive visual exploration. To save time and reduce memory load, users are only involved in the first step - initialization of sampling - and the last step - visual analysis of output. This helps users to more thoroughly explore the parameter space and produce higher quality results. We describe a custom sampling plug-in we developed for CellProfiler - a popular biomedical image analysis framework. Our main focus is the development of an interactive visualization technique that enables users to analyze the relationships between sampled input parameters and corresponding output. We implemented this in a prototype called Paramorama. It provides users with a visual overview of parameters and their sampled values. User-defined areas of interest are presented in a structured way that includes image-based output and a novel layout algorithm. To find optimal parameter settings, users can tag high- and low-quality results to refine their search. We include two case studies to illustrate the utility of this approach.","Authors":"Pretorius, A.J.;Bray, M.-A.P.;Carpenter, A.E.;Ruddle, R.A.","Clusters":"ImageBasedDataImageSignalProcessing;Parameterization;Sampling;","DOI":"10.1109\/TVCG.2011.253","Keywords":"information visualization;sampling;image analysis;visual analytics;parameter space","Keywords_Processed":"information visualization;sample;visual analytic;image analysis;paramet space","Title":"Visualization of Parameter Space for Image Analysis"},"366":{"Abstract":"Symmetric second-order tensor fields play a central role in scientific and biomedical studies as well as in image analysis and feature-extraction methods. The utility of displaying tensor field samples has driven the development of visualization techniques that encode the tensor shape and orientation into the geometry of a tensor glyph. With some exceptions, these methods work only for positive-definite tensors (i.e. having positive eigenvalues, such as diffusion tensors). We expand the scope of tensor glyphs to all symmetric second-order tensors in two and three dimensions, gracefully and unambiguously depicting any combination of positive and negative eigenvalues. We generalize a previous method of superquadric glyphs for positive-definite tensors by drawing upon a larger portion of the superquadric shape space, supplemented with a coloring that indicates the tensor's quadratic form. We show that encoding arbitrary eigenvalue sign combinations requires design choices that differ fundamentally from those in previous work on traceless tensors (arising in the study of liquid crystals). Our method starts with a design of 2-D tensor glyphs guided by principles of symmetry and continuity, and creates 3-D glyphs that include the 2-D glyphs in their axis-aligned cross-sections. A key ingredient of our method is a novel way of mapping from the shape space of three-dimensional symmetric second-order tensors to the unit square. We apply our new glyphs to stress tensors from mechanics, geometry tensors and Hessians from image analysis, and rate-of-deformation tensors in computational fluid dynamics.","Authors":"Schultz, T.;Kindlmann, G.","Clusters":"GlyphsGlyphBasedTechniques;TensorDataAndTechniques","DOI":"10.1109\/TVCG.2010.199","Keywords":"stress tensor;glyph design;geometry tensors;rate-of-deformation tensors;tensor glyphs","Keywords_Processed":"stress tensor;geometry tensor;tensor glyph;glyph design;rate of deformation tensor","Title":"Superquadric Glyphs for Symmetric Second-Order Tensors"},"58":{"Abstract":"Cardiovascular diseases (CVD) are the leading cause of death worldwide. Their initiation and evolution depends strongly on the blood flow characteristics. In recent years, advances in 4D PC-MRI acquisition enable reliable and time-resolved 3D flow measuring, which allows a qualitative and quantitative analysis of the patient-specific hemodynamics. Currently, medical researchers investigate the relation between characteristic flow patterns like vortices and different pathologies. The manual extraction and evaluation is tedious and requires expert knowledge. Standardized, (semi-)automatic and reliable techniques are necessary to make the analysis of 4D PC-MRI applicable for the clinical routine. In this work, we present an approach for the extraction of vortex flow in the aorta and pulmonary artery incorporating line predicates. We provide an extensive comparison of existent vortex extraction methods to determine the most suitable vortex criterion for cardiac blood flow and apply our approach to ten datasets with different pathologies like coarctations, Tetralogy of Fallot and aneurysms. For two cases we provide a detailed discussion how our results are capable to complement existent diagnosis information. To ensure real-time feedback for the domain experts we implement our method completely on the GPU.","Authors":"Kohler, B.;Gasteiger, R.;Preim, U.;Theisel, H.;Gutberlet, M.;Preim, B.","Clusters":"ApplicationsGeneralAndOther;BiomedicalScienceAndMedicine;FlowVisualizationDataAndTechniques;LineBasedTechniquesAndApproaches","DOI":"10.1109\/TVCG.2013.189","Keywords":"vortex extraction;line predicates;cardiac blood flow;hemodynamics;4d pc-mri","Keywords_Processed":"vortex extraction;hemodynamic;4d pc mri;line predicate;cardiac blood flow","Title":"Semi-Automatic Vortex Extraction in 4D PC-MRI Cardiac Blood Flow Data using Line Predicates"},"346":{"Abstract":"Volume ray-casting with a higher order reconstruction filter and\/or a higher sampling rate has been adopted in direct volume rendering frameworks to provide a smooth reconstruction of the volume scalar and\/or to reduce artifacts when the combined frequency of the volume and transfer function is high. While it enables high-quality volume rendering, it cannot support interactive rendering due to its high computational cost. In this paper, we propose a fast high-quality volume ray-casting algorithm which effectively increases the sampling rate. While a ray traverses the volume, intensity values are uniformly reconstructed using a high-order convolution filter. Additional samplings, referred to as virtual samplings, are carried out within a ray segment from a cubic spline curve interpolating those uniformly reconstructed intensities. These virtual samplings are performed by evaluating the polynomial function of the cubic spline curve via simple arithmetic operations. The min max blocks are refined accordingly for accurate empty space skipping in the proposed method. Experimental results demonstrate that the proposed algorithm, also exploiting fast cubic texture filtering supported by programmable GPUs, offers renderings as good as a conventional ray-casting algorithm using high-order reconstruction filtering at the same sampling rate, while delivering 2.5x to 3.3x rendering speed-up.","Authors":"Byeonghun Lee;Jihye Yun;Jinwook Seo;Byonghyo Shim;Yeong Gil Shin;Bohyoung Kim","Clusters":"CurvesAndCurvature;GpuBasedTechniques;VolumeRenderingModelingAndVisualization","DOI":"10.1109\/TVCG.2010.155","Keywords":"direct volume rendering;curve interpolation;high quality;gpu","Keywords_Processed":"curve interpolation;gpu;high quality;direct volume render","Title":"Fast High-Quality Volume Ray Casting with Virtual Samplings"},"262":{"Abstract":"Better understanding of hemodynamics conceivably leads to improved diagnosis and prognosis of cardiovascular diseases. Therefore, an elaborate analysis of the blood-flow in heart and thoracic arteries is essential. Contemporary MRI techniques enable acquisition of quantitative time-resolved flow information, resulting in 4D velocity fields that capture the blood-flow behavior. Visual exploration of these fields provides comprehensive insight into the unsteady blood-flow behavior, and precedes a quantitative analysis of additional blood-flow parameters. The complete inspection requires accurate segmentation of anatomical structures, encompassing a time-consuming and hard-to-automate process, especially for malformed morphologies. We present a way to avoid the laborious segmentation process in case of qualitative inspection, by introducing an interactive virtual probe. This probe is positioned semi-automatically within the blood-flow field, and serves as a navigational object for visual exploration. The difficult task of determining position and orientation along the view-direction is automated by a fitting approach, aligning the probe with the orientations of the velocity field. The aligned probe provides an interactive seeding basis for various flow visualization approaches. We demonstrate illustration-inspired particles, integral lines and integral surfaces, conveying distinct characteristics of the unsteady blood-flow. Lastly, we present the results of an evaluation with domain experts, valuing the practical use of our probe and flow visualization techniques.","Authors":"van Pelt, R.;Olivan Bescos, J.;Breeuwer, M.;Clough, R.E.;Groller, E.;ter Haar Romenij, B.;Vilanova, A.","Clusters":"BiomedicalScienceAndMedicine;FlowVisualizationDataAndTechniques;IllustrativeVisualization;ImageBasedDataImageSignalProcessing;InteractionTechniquesGeneral","DOI":"10.1109\/TVCG.2011.215","Keywords":"flow visualization;phase-contrast cine mri;illustrative visualization;probing;multivalued images","Keywords_Processed":"illustrative visualization;probe;multivalue image;phase contrast cine mri;flow visualization","Title":"Interactive Virtual Probing of 4D MRI Blood-Flow"},"345":{"Abstract":"Insight into the dynamics of blood-flow considerably improves the understanding of the complex cardiovascular system and its pathologies. Advances in MRI technology enable acquisition of 4D blood-flow data, providing quantitative blood-flow velocities over time. The currently typical slice-by-slice analysis requires a full mental reconstruction of the unsteady blood-flow field, which is a tedious and highly challenging task, even for skilled physicians. We endeavor to alleviate this task by means of comprehensive visualization and interaction techniques. In this paper we present a framework for pre-clinical cardiovascular research, providing tools to both interactively explore the 4D blood-flow data and depict the essential blood-flow characteristics. The framework encompasses a variety of visualization styles, comprising illustrative techniques as well as improved methods from the established field of flow visualization. Each of the incorporated styles, including exploded planar reformats, flow-direction highlights, and arrow-trails, locally captures the blood-flow dynamics and may be initiated by an interactively probed vessel cross-section. Additionally, we present the results of an evaluation with domain experts, measuring the value of each of the visualization styles and related rendering parameters.","Authors":"van Pelt, R.;Olivan Bescos, J.;Breeuwer, M.;Clough, R.E.;Groller, E.;ter Haar Romenij, B.;Vilanova, A.","Clusters":"BiomedicalScienceAndMedicine;FlowVisualizationDataAndTechniques;IllustrativeVisualization;InteractionTechniquesGeneral","DOI":"10.1109\/TVCG.2010.153","Keywords":"flow visualization;phase-contrast cine mri;illustrative visualization;probing;4d mri blood-flow","Keywords_Processed":"illustrative visualization;probe;4d mri blood flow;phase contrast cine mri;flow visualization","Title":"Exploration of 4D MRI Blood Flow using Stylistic Visualization"},"245":{"Abstract":"Parameterization of complex surfaces constitutes a major means of visualizing highly convoluted geometric structures as well as other properties associated with the surface. It also enables users with the ability to navigate, orient, and focus on regions of interest within a global view and overcome the occlusions to inner concavities. In this paper, we propose a novel area-preserving surface parameterization method which is rigorous in theory, moderate in computation, yet easily extendable to surfaces of non-disc and closed-boundary topologies. Starting from the distortion induced by an initial parameterization, an area restoring diffeomorphic flow is constructed as a Lie advection of differential 2-forms along the manifold, which yields equality of the area elements between the domain and the original surface at its final state. Existence and uniqueness of result are assured through an analytical derivation. Based upon a triangulated surface representation, we also present an efficient algorithm in line with discrete differential modeling. As an exemplar application, the utilization of this method for the effective visualization of brain cortical imaging modalities is presented. Compared with conformal methods, our method can reveal more subtle surface patterns in a quantitative manner. It, therefore, provides a competitive alternative to the existing parameterization techniques for better surface-based analysis in various scenarios.","Authors":"Guangyu Zou;Jiaxi Hu;Xianfeng Gu;Jing Hua","Clusters":"NumericalMethodsMathematics;SurfaceRelatedDataAndTechniques","DOI":"10.1109\/TVCG.2011.171","Keywords":"lie advection;differential forms;area-preserving surface parameterization;surface visualization","Keywords_Processed":"surface visualization;differential form;lie advection;area preserve surface parameterization","Title":"Authalic Parameterization of General Surfaces Using Lie Advection"},"355":{"Abstract":"This paper presents an interactive visualization tool to study and analyze hyperspectral images (HSI) of historical documents. This work is part of a collaborative effort with the Nationaal Archief of the Netherlands (NAN) and Art Innovation, a manufacturer of hyperspectral imaging hardware designed for old and fragile documents. The NAN is actively capturing HSI of historical documents for use in a variety of tasks related to the analysis and management of archival collections, from ink and paper analysis to monitoring the effects of environmental aging. To assist their work, we have developed a comprehensive visualization tool that offers an assortment of visualization and analysis methods, including interactive spectral selection, spectral similarity analysis, time-varying data analysis and visualization, and selective spectral band fusion. This paper describes our visualization software and how it is used to facilitate the tasks needed by our collaborators. Evaluation feedback from our collaborators on how this tool benefits their work is included.","Authors":"Seon Joo Kim;Shaojie Zhuo;Fanbo Deng;Chi-Wing Fu;Brown, M.S.","Clusters":"AnalysisProcessGeneral;DataRegistrationFusionAndIntegration;ImageBasedDataImageSignalProcessing;TextDocumentTopicAnalysisDataAndTechniques","DOI":"10.1109\/TVCG.2010.172","Keywords":"image fusion;document processing and analysis;data exploration;hyperspectral visualization","Keywords_Processed":"image fusion;hyperspectral visualization;document processing and analysis;datum exploration","Title":"Interactive Visualization of Hyperspectral Images of Historical Documents"},"276":{"Abstract":"We present topological spines-a new visual representation that preserves the topological and geometric structure of a scalar field. This representation encodes the spatial relationships of the extrema of a scalar field together with the local volume and nesting structure of the surrounding contours. Unlike other topological representations, such as contour trees, our approach preserves the local geometric structure of the scalar field, including structural cycles that are useful for exposing symmetries in the data. To obtain this representation, we describe a novel mechanism based on the extraction of extremum graphs-sparse subsets of the Morse-Smale complex that retain the important structural information without the clutter and occlusion problems that arise from visualizing the entire complex directly. Extremum graphs form a natural multiresolution structure that allows the user to suppress noise and enhance topological features via the specification of a persistence range. Applications of our approach include the visualization of 3D scalar fields without occlusion artifacts, and the exploratory analysis of high-dimensional functions.","Authors":"Correa, C.;Lindstrom, P.;Bremer, P.-T.","Clusters":"GraphNetworkDataAndTechniques;ScalarFieldDataTechniques;TopologyBasedTechniques","DOI":"10.1109\/TVCG.2011.244","Keywords":"scalar field topology;extremum graph;topological spine;morse-smale complex","Keywords_Processed":"scalar field topology;extremum graph;topological spine;morse smale complex","Title":"Topological Spines: A Structure-preserving Visual Representation of Scalar fields"},"195":{"Abstract":"Increasingly, social network datasets contain social attribute information about actors and their relationship. Analyzing such network with social attributes requires making sense of not only its structural features, but also the relationship between social features in attributes and network structures. Existing social network analysis tools are usually weak in supporting complex analytical tasks involving both structural and social features, and often overlook users' needs for sensemaking tools that help to gather, synthesize, and organize information of these features. To address these challenges, we propose a sensemaking framework of social-network visual analytics in this paper. This framework considers both bottom-up processes, which are about constructing new understandings based on collected information, and top-down processes, which concern using prior knowledge to guide information collection, in analyzing social networks from both social and structural perspectives. The framework also emphasizes the externalization of sensemaking processes through interactive visualization. Guided by the framework, we develop a system, SocialNetSense, to support the sensemaking in visual analytics of social networks with social attributes. The example of using our system to analyze a scholar collaboration network shows that our approach can help users gain insight into social networks both structurally and socially, and enhance their process awareness in visual analytics.","Authors":"Liang Gou;Xiaolong Zhang;Airong Luo;Anderson, P.F.","Clusters":"Cognition;SocialNetworksAndSocialMedia;VisualizationSystemsToolkitsAndEnvironments","DOI":"10.1109\/VAST.2012.6400558","Keywords":"socialnetsense;sensemaking;visualization;visual analytics;social networks","Keywords_Processed":"socialnetsense;visualization;sensemake;social network;visual analytic","Title":"SocialNetSense: Supporting sensemaking of social and structural features in networks with interactive visualization"},"304":{"Abstract":"We investigate the design of declarative, domain-specific languages for constructing interactive visualizations. By separating specification from execution, declarative languages can simplify development, enable unobtrusive optimization, and support retargeting across platforms. We describe the design of the Protovis specification language and its implementation within an object-oriented, statically-typed programming language (Java). We demonstrate how to support rich visualizations without requiring a toolkit-specific data model and extend Protovis to enable declarative specification of animated transitions. To support cross-platform deployment, we introduce rendering and event-handling infrastructures decoupled from the runtime platform, letting designers retarget visualization specifications (e.g., from desktop to mobile phone) with reduced effort. We also explore optimizations such as runtime compilation of visualization specifications, parallelized execution, and hardware-accelerated rendering. We present benchmark studies measuring the performance gains provided by these optimizations and compare performance to existing Java-based visualization tools, demonstrating scalability improvements exceeding an order of magnitude.","Authors":"Heer, J.;Bostock, M.","Clusters":"Optimization;ProgrammingAlgorithmsAndDataStructures;UserInterfacesGeneral;VisualizationSystemsToolkitsAndEnvironments","DOI":"10.1109\/TVCG.2010.144","Keywords":"information visualization;user interface;optimization;toolkits;declarative languages;domain-specific languages","Keywords_Processed":"optimization;user interface;domain specific language;information visualization;declarative language;toolkit","Title":"Declarative Language Design for Interactive Visualization"},"382":{"Abstract":"The massive amount of financial time series data that originates from the stock market generates large amounts of complex data of high interest. However, adequate solutions that can effectively handle the information in order to gain insight and to understand the market mechanisms are rare. In this paper, we present two techniques and applications that enable the user to interactively analyze large amounts of time series data in real-time in order to get insight into the development of assets, market sectors, countries, and the financial market as a whole. The first technique allows users to quickly analyze combinations of single assets, market sectors as well as countries, compare them to each other, and to visually discover the periods of time where market sectors and countries get into turbulence. The second application clusters a selection of large amounts of financial time series data according to their similarity, and analyzes the distribution of the assets among market sectors. This allows users to identify the characteristic graphs which are representative for the development of a particular market sector, and also to identify the assets which behave considerably differently compared to other assets in the same sector. Both applications allow the user to perform investigative exploration techniques and interactive visual analysis in real-time.","Authors":"Ziegler, H.;Jenny, M.;Gruse, T.;Keim, D.A.","Clusters":"AnalysisProcessGeneral;BusinessFinanceEconomyManufacturing;TimeseriesTimeVaryingDataAndTechniques;","DOI":"10.1109\/VAST.2010.5652530","Keywords":"exploratory data analysis;time-series data;time-series clustering;visual analytics;financial information visualization","Keywords_Processed":"time series clustering;financial information visualization;visual analytic;time series datum;exploratory datum analysis","Title":"Visual market sector analysis for financial time series data"},"379":{"Abstract":"Data sets in astronomy are growing to enormous sizes. Modern astronomical surveys provide not only image data but also catalogues of millions of objects (stars, galaxies), each object with hundreds of associated parameters. Exploration of this very high-dimensional data space poses a huge challenge. Subspace clustering is one among several approaches which have been proposed for this purpose in recent years. However, many clustering algorithms require the user to set a large number of parameters without any guidelines. Some methods also do not provide a concise summary of the datasets, or, if they do, they lack additional important information such as the number of clusters present or the significance of the clusters. In this paper, we propose a method for ranking subspaces for clustering which overcomes many of the above limitations. First we carry out a transformation from parametric space to discrete image space where the data are represented by a grid-based density field. Then we apply so-called connected morphological operators on this density field of astronomical objects that provides visual support for the analysis of the important subspaces. Clusters in subspaces correspond to high-intensity regions in the density image. The importance of a cluster is measured by a new quality criterion based on the dynamics of local maxima of the density. Connected operators are able to extract such regions with an indication of the number of clusters present. The subspaces are visualized during computation of the quality measure, so that the user can interact with the system to improve the results. In the result stage, we use three visualization toolkits linked within a graphical user interface so that the user can perform an in-depth exploration of the ranked subspaces. Evaluation based on synthetic as well as real astronomical datasets demonstrates the power of the new method. We recover various known astronomical relations directly from the data with little or no a pri- - ori assumptions. Hence, our method holds good prospects for discovering new relations as well.","Authors":"Ferdosi, B.J.;Buddelmeijer, H.;Trager, S.;Wilkinson, M.H.F.;Roerdink, J.B.T.","Clusters":"AnalysisProcessGeneral;AstronomyAstrophysics;DataClusteringAndAggregation;ImageBasedDataImageSignalProcessing;SpaceRelatedSpatialDataAndTechniques","DOI":"10.1109\/VAST.2010.5652450","Keywords":"astronomical data;clustering high-dimensional data;visual exploration;connected morphological operators;subspace finding","Keywords_Processed":"visual exploration;cluster high dimensional datum;connected morphological operator;astronomical datum;subspace finding","Title":"finding and visualizing relevant subspaces for clustering high-dimensional astronomical data using connected morphological operators"},"361":{"Abstract":"Graphics artists commonly employ physically-based simulation for the generation of effects such as smoke, explosions, and similar phenomena. The task of finding the correct parameters for a desired result, however, is difficult and time-consuming as current tools provide little to no guidance. In this paper, we present a new approach for the visual exploration of such parameter spaces. Given a three-dimensional scene description, we utilize sampling and spatio-temporal clustering techniques to generate a concise overview of the achievable variations and their temporal evolution. Our visualization system then allows the user to explore the simulation space in a goal-oriented manner. Animation sequences with a set of desired characteristics can be composed using a novel search-by-example approach and interactive direct volume rendering is employed to provide instant visual feedback.","Authors":"Bruckner, S.;Moller, T.","Clusters":"AnalysisProcessGeneral;ApplicationsGeneralAndOther;DataClusteringAndAggregation;TimeseriesTimeVaryingDataAndTechniques","DOI":"10.1109\/TVCG.2010.190","Keywords":"visual exploration;visual effects;clustering;time-dependent volume data","Keywords_Processed":"time dependent volume datum;clustering;visual effect;visual exploration","Title":"Result-Driven Exploration of Simulation Parameter Spaces for Visual Effects Design"},"297":{"Abstract":"Asynchronous Collaborative Visual Analytics (ACVA) leverages group sensemaking by releasing the constraints on when, where, and who works collaboratively. A significant task to be addressed before ACVA can reach its full potential is effective common ground construction, namely the process in which users evaluate insights from individual work to develop a shared understanding of insights and collectively pool them. This is challenging due to the lack of instant communication and scale of collaboration in ACVA. We propose a novel visual analytics approach that automatically gathers, organizes, and summarizes insights to form common ground with reduced human effort. The rich set of visualization and interaction techniques provided in our approach allows users to effectively and flexibly control the common ground construction and review, explore, and compare insights in detail. A working prototype of the approach has been implemented. We have conducted a case study and a user study to demonstrate its effectiveness.","Authors":"Yang Chen;Alsakran, J.;Barlowe, S.;Jing Yang;Ye Zhao","Clusters":"AnalysisProcessGeneral;CollaborativeVisualization;MultidimensionalMultivariateMultifieldDataAndTechniques;","DOI":"10.1109\/VAST.2011.6102447","Keywords":"asynchronous collaboration;multi-dimensional visualization;insight;visual analytics","Keywords_Processed":"visual analytic;insight;multi dimensional visualization;asynchronous collaboration","Title":"Supporting effective common ground construction in Asynchronous Collaborative Visual Analytics"},"219":{"Abstract":"We introduce a focus+context method to visualize a complicated metro map of a modern city on a small displaying area. The context of our work is with regard the popularity of mobile devices. The best route to the destination, which can be obtained from the arrival time of trains, is highlighted. The stations on the route enjoy larger spaces, whereas the other stations are rendered smaller and closer to fit the whole map into a screen. To simplify the navigation and route planning for visitors, we formulate various map characteristics such as octilinear transportation lines and regular station distances into energy terms. We then solve for the optimal layout in a least squares sense. In addition, we label the names of stations that are on the route of a passenger according to human preferences, occlusions, and consistencies of label positions using the graph cuts method. Our system achieves real-time performance by being able to report instant information because of the carefully designed energy terms. We apply our method to layout a number of metro maps and show the results and timing statistics to demonstrate the feasibility of our technique.","Authors":"Yu-Shuen Wang;Ming-Te Chi","Clusters":"FocusContextTechniques;Labeling;Maps;Optimization;VisualEncodingAndLayoutGeneral","DOI":"10.1109\/TVCG.2011.205","Keywords":"optimization;focus+context visualization;graph labeling;octilinear layout;metro map","Keywords_Processed":"optimization;metro map;octilinear layout;focus context visualization;graph labeling","Title":"Focus+Context Metro Maps"},"158":{"Abstract":"Visual exploration of volumetric datasets to discover the embedded features and spatial structures is a challenging and tedious task. In this paper we present a semi-automatic approach to this problem that works by visually segmenting the intensity-gradient 2D histogram of a volumetric dataset into an exploration hierarchy. Our approach mimics user exploration behavior by analyzing the histogram with the normalized-cut multilevel segmentation technique. Unlike previous work in this area, our technique segments the histogram into a reasonable set of intuitive components that are mutually exclusive and collectively exhaustive. We use information-theoretic measures of the volumetric data segments to guide the exploration. This provides a data-driven coarse-to-fine hierarchy for a user to interactively navigate the volume in a meaningful manner.","Authors":"Cheuk Yiu Ip;Varshney, A.;JaJa, J.","Clusters":"AnalysisProcessGeneral;ImageBasedDataImageSignalProcessing;SegmentationAndClassification;VolumeRenderingModelingAndVisualization","DOI":"10.1109\/TVCG.2012.231","Keywords":"volume exploration;information-guided exploration;volume classification;normalized cut","Keywords_Processed":"normalize cut;information guide exploration;volume classification;volume exploration","Title":"Hierarchical Exploration of Volumes Using Multilevel Segmentation of the Intensity-Gradient Histograms"},"231":{"Abstract":"Generation of synthetic datasets is a common practice in many research areas. Such data is often generated to meet specific needs or certain conditions that may not be easily found in the original, real data. The nature of the data varies according to the application area and includes text, graphs, social or weather data, among many others. The common process to create such synthetic datasets is to implement small scripts or programs, restricted to small problems or to a specific application. In this paper we propose a framework designed to generate high dimensional datasets. Users can interactively create and navigate through multi dimensional datasets using a suitable graphical user-interface. The data creation is driven by statistical distributions based on a few user-defined parameters. First, a grounding dataset is created according to given inputs, and then structures and trends are included in selected dimensions and orthogonal projection planes. Furthermore, our framework supports the creation of complex non-orthogonal trends and classified datasets. It can successfully be used to create synthetic datasets simulating important trends as multidimensional clusters, correlations and outliers.","Authors":"Albuquerque, G.;Lowe, T.;Magnor, M.","Clusters":"DataAcquisitionAndManagement;InteractionTechniquesGeneral;MultidimensionalMultivariateMultifieldDataAndTechniques","DOI":"10.1109\/TVCG.2011.237","Keywords":"multivariate data;high-dimensional data;synthetic data generation;interaction","Keywords_Processed":"multivariate datum;high dimensional datum;interaction;synthetic datum generation","Title":"Synthetic Generation of High-Dimensional Datasets"},"273":{"Abstract":"Study of symmetric or repeating patterns in scalar fields is important in scientific data analysis because it gives deep insights into the properties of the underlying phenomenon. Though geometric symmetry has been well studied within areas like shape processing, identifying symmetry in scalar fields has remained largely unexplored due to the high computational cost of the associated algorithms. We propose a computationally efficient algorithm for detecting symmetric patterns in a scalar field distribution by analysing the topology of level sets of the scalar field. Our algorithm computes the contour tree of a given scalar field and identifies subtrees that are similar. We define a robust similarity measure for comparing subtrees of the contour tree and use it to group similar subtrees together. Regions of the domain corresponding to subtrees that belong to a common group are extracted and reported to be symmetric. Identifying symmetry in scalar fields finds applications in visualization, data exploration, and feature detection. We describe two applications in detail: symmetry-aware transfer function design and symmetry-aware isosurface extraction.","Authors":"Thomas, D.M.;Natarajan, V.","Clusters":"DataAndAnalysisMetrics;IsosurfaceAndSurfaceExtractionTechniques;ScalarFieldDataTechniques;TopologyBasedTechniques;VolumeRenderingModelingAndVisualization","DOI":"10.1109\/TVCG.2011.236","Keywords":"transfer function design;contour tree;isosurface extraction;similarity measure;scalar field symmetry;persistence","Keywords_Processed":"contour tree;similarity measure;isosurface extraction;persistence;scalar field symmetry;transfer function design","Title":"Symmetry in Scalar field Topology"},"267":{"Abstract":"Medical imaging plays a central role in a vast range of healthcare practices. The usefulness of 3D visualizations has been demonstrated for many types of treatment planning. Nevertheless, full access to 3D renderings outside of the radiology department is still scarce even for many image-centric specialties. Our work stems from the hypothesis that this under-utilization is partly due to existing visualization systems not taking the prerequisites of this application domain fully into account. We have developed a medical visualization table intended to better fit the clinical reality. The overall design goals were two-fold: similarity to a real physical situation and a very low learning threshold. This paper describes the development of the visualization table with focus on key design decisions. The developed features include two novel interaction components for touch tables. A user study including five orthopedic surgeons demonstrates that the system is appropriate and useful for this application domain.","Authors":"Lundstrom, C.;Rydell, T.;Forsell, C.;Persson, A.;Ynnerman, A.","Clusters":"BiomedicalScienceAndMedicine;InteractionTechniquesGeneral;LargeAndHighResDisplays","DOI":"10.1109\/TVCG.2011.224","Keywords":"medical visualization;tabletop;multi-touch;treatment planning","Keywords_Processed":"tabletop;multi touch;medical visualization;treatment planning","Title":"Multi-Touch Table System for Medical Visualization: Application to Orthopedic Surgery Planning"},"237":{"Abstract":"Narrative visualizations combine conventions of communicative and exploratory information visualization to convey an intended story. We demonstrate visualization rhetoric as an analytical framework for understanding how design techniques that prioritize particular interpretations in visualizations that \"tell a story\" can significantly affect end-user interpretation. We draw a parallel between narrative visualization interpretation and evidence from framing studies in political messaging, decision-making, and literary studies. Devices for understanding the rhetorical nature of narrative information visualizations are presented, informed by the rigorous application of concepts from critical theory, semiotics, journalism, and political theory. We draw attention to how design tactics represent additions or omissions of information at various levels-the data, visual representation, textual annotations, and interactivity-and how visualizations denote and connote phenomena with reference to unstated viewing conventions and codes. Classes of rhetorical techniques identified via a systematic analysis of recent narrative visualizations are presented, and characterized according to their rhetorical contribution to the visualization. We describe how designers and researchers can benefit from the potentially positive aspects of visualization rhetoric in designing engaging, layered narrative visualizations and how our framework can shed light on how a visualization design prioritizes specific interpretations. We identify areas where future inquiry into visualization rhetoric can improve understanding of visualization interpretation.","Authors":"Hullman, J.;Diakopoulos, N.","Clusters":"SemanticsSemioticsRelatedTechniques;Storytelling;TextDocumentTopicAnalysisDataAndTechniques","DOI":"10.1109\/TVCG.2011.255","Keywords":"semiotics;narrative visualization;connotation;framing effects;denotation;rhetoric","Keywords_Processed":"narrative visualization;frame effect;denotation;semiotic;connotation;rhetoric","Title":"Visualization Rhetoric: Framing Effects in Narrative Visualization"},"12":{"Abstract":"We describe and demonstrate an extensible framework that supports data exploration and provenance in the context of Human Terrain Analysis (HTA). Working closely with defence analysts we extract requirements and a list of features that characterise data analysed at the end of the HTA chain. From these, we select an appropriate non-classified data source with analogous features, and model it as a set of facets. We develop ProveML, an XML-based extension of the Open Provenance Model, using these facets and augment it with the structures necessary to record the provenance of data, analytical process and interpretations. Through an iterative process, we develop and refine a prototype system for Human Terrain Visual Analytics (HTVA), and demonstrate means of storing, browsing and recalling analytical provenance and process through analytic bookmarks in ProveML. We show how these bookmarks can be combined to form narratives that link back to the live data. Throughout the process, we demonstrate that through structured workshops, rapid prototyping and structured communication with intelligence analysts we are able to establish requirements, and design schema, techniques and tools that meet the requirements of the intelligence community. We use the needs and reactions of defence analysts in defining and steering the methods to validate the framework.","Authors":"Walker, R.;Slingsby, A.;Dykes, J.;Kai Xu;Wood, J.;Nguyen, P.H.;Stephens, D.;Wong, B.L.W.;Yongjun Zheng","Clusters":"GeographyGeospatialVisCartographyTerrainVis;InternetWebVisualizationForTheMasses;ProvenanceAndHistory;Storytelling;VisualizationSystemsToolkitsAndEnvironments","DOI":"10.1109\/TVCG.2013.132","Keywords":"human terrain analysis;provenance;bookmarks;framework;narrative","Keywords_Processed":"human terrain analysis;framework;narrative;bookmark;provenance","Title":"An Extensible Framework for Provenance in Human Terrain Visual Analytics"},"244":{"Abstract":"Asymmetric tensor field visualization can provide important insight into fluid flows and solid deformations. Existing techniques for asymmetric tensor fields focus on the analysis, and simply use evenly-spaced hyperstreamlines on surfaces following eigenvectors and dual-eigenvectors in the tensor field. In this paper, we describe a hybrid visualization technique in which hyperstreamlines and elliptical glyphs are used in real and complex domains, respectively. This enables a more faithful representation of flow behaviors inside complex domains. In addition, we encode tensor magnitude, an important quantity in tensor field analysis, using the density of hyperstreamlines and sizes of glyphs. This allows colors to be used to encode other important tensor quantities. To facilitate quick visual exploration of the data from different viewpoints and at different resolutions, we employ an efficient image-space approach in which hyperstreamlines and glyphs are generated quickly in the image plane. The combination of these techniques leads to an efficient tensor field visualization system for domain scientists. We demonstrate the effectiveness of our visualization technique through applications to complex simulated engine fluid flow and earthquake deformation data. Feedback from domain expert scientists, who are also co-authors, is provided.","Authors":"Guoning Chen;Palke, D.;Zhongzang Lin;Yeh, H.;Vincent, P.;Laramee, R.S.;Zhang, E.","Clusters":"GlyphsGlyphBasedTechniques;StreamlinesPathlinesStreaklines;TensorDataAndTechniques;VectorFieldsDataAndTechniques;ViewDependentVisualization","DOI":"10.1109\/TVCG.2011.170","Keywords":"hyperstreamline placement;vector field;asymmetric tensor fields;glyph packing;view-dependent","Keywords_Processed":"vector field;hyperstreamline placement;asymmetric tensor field;glyph packing;view dependent","Title":"Asymmetric Tensor field Visualization for Surfaces"},"241":{"Abstract":"Color vision deficiency (CVD) affects a high percentage of the population worldwide. When seeing a volume visualization result, persons with CVD may be incapable of discriminating the classification information expressed in the image if the color transfer function or the color blending used in the direct volume rendering is not appropriate. Conventional methods used to address this problem adopt advanced image recoloring techniques to enhance the rendering results frame-by-frame; unfortunately, problematic perceptual results may still be generated. This paper proposes an alternative solution that complements the image recoloring scheme by reconfiguring the components of the direct volume rendering (DVR) pipeline. Our approach optimizes the mapped colors of a transfer function to simulate CVD-friendly effect that is generated by applying the image recoloring to the results with the initial transfer function. The optimization process has a low computational complexity, and only needs to be performed once for a given transfer function. To achieve detail-preserving and perceptually natural semi-transparent effects, we introduce a new color composition mode that works in the color space of dichromats. Experimental results and a pilot study demonstrates that our approach can yield dichromats-friendly and consistent volume visualization in real-time.","Authors":"Weifeng Chen;Wei Chen;Hujun Bao","Clusters":"ColorColorPerception;ImageBasedDataImageSignalProcessing;SegmentationAndClassification;VolumeRenderingModelingAndVisualization","DOI":"10.1109\/TVCG.2011.164","Keywords":"direct volume rendering;image recoloring;dichromacy;volume classification","Keywords_Processed":"dichromacy;image recoloring;volume classification;direct volume render","Title":"An Efficient Direct Volume Rendering Approach for Dichromats"},"102":{"Abstract":"We characterize the design space of the algorithms that sequentially tile a rectangular area with smaller, fixed-surface, rectangles. This space consist of five independent dimensions: Order, Size, Score, Recurse and Phrase. Each of these dimensions describe a particular aspect of such layout tasks. This class of layouts is interesting, because, beyond encompassing simple grids, tables and trees, it also includes all kinds of treemaps involving the placement of rectangles. For instance, Slice and dice, Squarified, Strip and Pivot layouts are various points in this five dimensional space. Many classic statistics visualizations, such as 100% stacked bar charts, mosaic plots and dimensional stacking, are also instances of this class. A few new and potentially interesting points in this space are introduced, such as spiral treemaps and variations on the strip layout. The core algorithm is implemented as a JavaScript prototype that can be used as a layout component in a variety of InfoViz toolkits.","Authors":"Baudel, T.;Broeksema, B.","Clusters":"ChartsDiagramsPlots;DimensionalityReduction;HierarchicalTreeDataAndTechniques;MeshesGridsAndLattices;VisualEncodingAndLayoutGeneral;VisualizationTheoryModelsAndMethods","DOI":"10.1109\/TVCG.2012.205","Keywords":"mosaic plots;grids;visualization models;layout;treemap;dimensional stacking;tables & tree layouts","Keywords_Processed":"grid;treemap;layout;table tree layout;dimensional stacking;visualization model;mosaic plot","Title":"Capturing the Design Space of Sequential Space-filling Layouts"},"322":{"Abstract":"Treemaps are space-filling visualizations that make efficient use of limited display space to depict large amounts of hierarchical data. Creating perceptually effective treemaps requires carefully managing a number of design parameters including the aspect ratio and luminance of rectangles. Moreover, treemaps encode values using area, which has been found to be less accurate than judgments of other visual encodings, such as length. We conduct a series of controlled experiments aimed at producing a set of design guidelines for creating effective rectangular treemaps. We find no evidence that luminance affects area judgments, but observe that aspect ratio does have an effect. Specifically, we find that the accuracy of area comparisons suffers when the compared rectangles have extreme aspect ratios or when both are squares. Contrary to common assumptions, the optimal distribution of rectangle aspect ratios within a treemap should include non-squares, but should avoid extremes. We then compare treemaps with hierarchical bar chart displays to identify the data densities at which length-encoded bar charts become less effective than area-encoded treemaps. We report the transition points at which treemaps exhibit judgment accuracy on par with bar charts for both leaf and non-leaf tree nodes. We also find that even at relatively low data densities treemaps result in faster comparisons than bar charts. Based on these results, we present a set of guidelines for the effective use of treemaps and suggest alternate approaches for treemap layout.","Authors":"Kong, N.;Heer, J.;Agrawala, M.","Clusters":"EvaluationGeneral;HierarchicalTreeDataAndTechniques;Perception;VisualEncodingAndLayoutGeneral","DOI":"10.1109\/TVCG.2010.186","Keywords":"mechanical turk;treemap;graphical perception;rectangular area;visualization;visual encoding;experiment","Keywords_Processed":"visualization;rectangular area;treemap;visual encoding;graphical perception;experiment;mechanical turk","Title":"Perceptual Guidelines for Creating Rectangular Treemaps"},"301":{"Abstract":"We introduce the concept of a Visual Backchannel as a novel way of following and exploring online conversations about large-scale events. Microblogging communities, such as Twitter, are increasingly used as digital backchannels for timely exchange of brief comments and impressions during political speeches, sport competitions, natural disasters, and other large events. Currently, shared updates are typically displayed in the form of a simple list, making it difficult to get an overview of the fast-paced discussions as it happens in the moment and how it evolves over time. In contrast, our Visual Backchannel design provides an evolving, interactive, and multi-faceted visual overview of large-scale ongoing conversations on Twitter. To visualize a continuously updating information stream, we include visual saliency for what is happening now and what has just happened, set in the context of the evolving conversation. As part of a fully web-based coordinated-view system we introduce Topic Streams, a temporally adjustable stacked graph visualizing topics over time, a People Spiral representing participants and their activity, and an Image Cloud encoding the popularity of event photos by size. Together with a post listing, these mutually linked views support cross-filtering along topics, participants, and time ranges. We discuss our design considerations, in particular with respect to evolving visualizations of dynamically changing data. Initial feedback indicates significant interest and suggests several unanticipated uses.","Authors":"Dork, M.;Gruen, D.;Williamson, C.;Carpendale, S.","Clusters":"DatabasesAndDataMining;EventsTrendsOutlierDetectionAnalysisAndVisualization;InternetWebVisualizationForTheMasses;MultipleLinkedCoordinatedViews;SocialNetworksAndSocialMedia;SocialScienceAndHumanities;","DOI":"10.1109\/TVCG.2010.129","Keywords":"information visualization;information retrieval;backchannel;multiple views;microblogging;events;world wide web","Keywords_Processed":"world wide web;information retrieval;information visualization;backchannel;multiple view;microblogge;event","Title":"A Visual Backchannel for Large-Scale Events"},"141":{"Abstract":"The process of surface perception is complex and based on several influencing factors, e.g., shading, silhouettes, occluding contours, and top down cognition. The accuracy of surface perception can be measured and the influencing factors can be modified in order to decrease the error in perception. This paper presents a novel concept of how a perceptual evaluation of a visualization technique can contribute to its redesign with the aim of improving the match between the distal and the proximal stimulus. During analysis of data from previous perceptual studies, we observed that the slant of 3D surfaces visualized on 2D screens is systematically underestimated. The visible trends in the error allowed us to create a statistical model of the perceived surface slant. Based on this statistical model we obtained from user experiments, we derived a new shading model that uses adjusted surface normals and aims to reduce the error in slant perception. The result is a shape-enhancement of visualization which is driven by an experimentally-founded statistical model. To assess the efficiency of the statistical shading model, we repeated the evaluation experiment and confirmed that the error in perception was decreased. Results of both user experiments are publicly-available datasets.","Authors":"Solteszova, V.;Turkay, C.;Price, M.C.;Viola, I.","Clusters":"EvaluationGeneral;MachineLearningAndStatistics;Perception;Rendering;SurfaceRelatedDataAndTechniques","DOI":"10.1109\/TVCG.2012.188","Keywords":"shading;surface slant;perception;evaluation;statistical analysis","Keywords_Processed":"shade;perception;surface slant;evaluation;statistical analysis","Title":"A Perceptual-Statistics Shading Model"},"98":{"Abstract":"Comparing slopes is a fundamental graph reading task and the aspect ratio chosen for a plot influences how easy these comparisons are to make. According to Banking to 45Â°, a classic design guideline first proposed and studied by Cleveland et al., aspect ratios that center slopes around 45Â° minimize errors in visual judgments of slope ratios. This paper revisits this earlier work. Through exploratory pilot studies that expand Cleveland et al.'s experimental design, we develop an empirical model of slope ratio estimation that fits more extreme slope ratio judgments and two common slope ratio estimation strategies. We then run two experiments to validate our model. In the first, we show that our model fits more generally than the one proposed by Cleveland et al. and we find that, in general, slope ratio errors are not minimized around 45Â°. In the second experiment, we explore a novel hypothesis raised by our model: that visible baselines can substantially mitigate errors made in slope judgments. We conclude with an application of our model to aspect ratio selection.","Authors":"Talbot, J.;Gerth, J.;Hanrahan, P.","Clusters":"Perception;VectorFieldsDataAndTechniques;VisualEncodingAndLayoutGeneral","DOI":"10.1109\/TVCG.2012.196","Keywords":"slope perception;orientation resolution;aspect ratio selection;banking to 45 degrees","Keywords_Processed":"orientation resolution;aspect ratio selection;banking to 45 degree;slope perception","Title":"An Empirical Model of Slope Ratio Comparisons"},"110":{"Abstract":"This paper reports on a between-subject, comparative online study of three information visualization demonstrators that each displayed the same dataset by way of an identical scatterplot technique, yet were different in style in terms of visual and interactive embellishment. We validated stylistic adherence and integrity through a separate experiment in which a small cohort of participants assigned our three demonstrators to predefined groups of stylistic examples, after which they described the styles with their own words. From the online study, we discovered significant differences in how participants execute specific interaction operations, and the types of insights that followed from them. However, in spite of significant differences in apparent usability, enjoyability and usefulness between the style demonstrators, no variation was found on the self-reported depth, expert-rated depth, confidence or difficulty of the resulting insights. Three different methods of insight analysis have been applied, revealing how style impacts the creation of insights, ranging from higher-level pattern seeking to a more reflective and interpretative engagement with content, which is what underlies the patterns. As this study only forms the first step in determining how the impact of style in information visualization could be best evaluated, we propose several guidelines and tips on how to gather, compare and categorize insights through an online evaluation study, particularly in terms of analyzing the concise, yet wide variety of insights and observations in a trustworthy and reproducable manner.","Authors":"Vande Moere, A.;Tomitsch, M.;Wimmer, C.;Christoph, B.;Grechenig, T.","Clusters":"ArtAndAestheticsInVisualization;EvaluationGeneral;IllustrativeVisualization;VisualDesignDesignGuidelines","DOI":"10.1109\/TVCG.2012.221","Keywords":"online study;aesthetics;style;visualization;user experience;design;evaluation","Keywords_Processed":"visualization;style;design;user experience;online study;evaluation;aesthetic","Title":"Evaluating the Effect of Style in Information Visualization"},"320":{"Abstract":"Interactive visualization requires the translation of data into a screen space of limited resolution. While currently ignored by most visualization models, this translation entails a loss of information and the introduction of a number of artifacts that can be useful, (e.g., aggregation, structures) or distracting (e.g., over-plotting, clutter) for the analysis. This phenomenon is observed in parallel coordinates, where overlapping lines between adjacent axes form distinct patterns, representing the relation between variables they connect. However, even for a small number of dimensions, the challenge is to effectively convey the relationships for all combinations of dimensions. The size of the dataset and a large number of dimensions only add to the complexity of this problem. To address these issues, we propose Pargnostics, parallel coordinates diagnostics, a model based on screen-space metrics that quantify the different visual structures. Pargnostics metrics are calculated for pairs of axes and take into account the resolution of the display as well as potential axis inversions. Metrics include the number of line crossings, crossing angles, convergence, overplotting, etc. To construct a visualization view, the user can pick from a ranked display showing pairs of coordinate axes and the structures between them, or examine all possible combinations of axes at once in a matrix display. Picking the best axes layout is an NP-complete problem in general, but we provide a way of automatically optimizing the display according to the user's preferences based on our metrics and model.","Authors":"Dasgupta, A.;Kosara, R.","Clusters":"DisplaysGeneral;EvaluationMetricsAndBenchmarks;ParallelCoordinates;VisualizationTheoryModelsAndMethods","DOI":"10.1109\/TVCG.2010.184","Keywords":"display optimization;visualization models;parallel coordinates;metrics","Keywords_Processed":"parallel coordinate;metric;visualization model;display optimization","Title":"Pargnostics: Screen-Space Metrics for Parallel Coordinates"},"3":{"Abstract":"Many application domains deal with multi-variate data that consist of both categorical and numerical information. Small-multiple displays are a powerful concept for comparing such data by juxtaposition. For comparison by overlay or by explicit encoding of computed differences, however, a specification of references is necessary. In this paper, we present a formal model for defining semantically meaningful comparisons between many categories in a small-multiple display. Based on pivotized data that are hierarchically partitioned by the categories assigned to the x and y axis of the display, we propose two alternatives for structure-based comparison within this hierarchy. With an absolute reference specification, categories are compared to a fixed reference category. With a relative reference specification, in contrast, a semantic ordering of the categories is considered when comparing them either to the previous or subsequent category each. Both reference specifications can be defined at multiple levels of the hierarchy (including aggregated summaries), enabling a multitude of useful comparisons. We demonstrate the general applicability of our model in several application examples using different visualizations that compare data by overlay or explicit encoding of differences.","Authors":"Kehrer, J.;Piringer, H.;Berger, W.;Groller, E.","Clusters":"CategoricalDataAndTechniques;ComparisonComparativeVisualizationAndSimilarity;VisualEncodingAndLayoutGeneral;VisualizationTechniquesAndToolsGeneral","DOI":"10.1109\/TVCG.2013.122","Keywords":"trellis displays;categorical data;comparative visualization;small multiples","Keywords_Processed":"trelli display;comparative visualization;small multiple;categorical datum","Title":"A Model for Structure-Based Comparison of Many Categories in Small-Multiple Displays"},"146":{"Abstract":"Cerebral aneurysms are a pathological vessel dilatation that bear a high risk of rupture. For the understanding and evaluation of the risk of rupture, the analysis of hemodynamic information plays an important role. Besides quantitative hemodynamic information, also qualitative flow characteristics, e.g., the inflow jet and impingement zone are correlated with the risk of rupture. However, the assessment of these two characteristics is currently based on an interactive visual investigation of the flow field, obtained by computational fluid dynamics (CFD) or blood flow measurements. We present an automatic and robust detection as well as an expressive visualization of these characteristics. The detection can be used to support a comparison, e.g., of simulation results reflecting different treatment options. Our approach utilizes local streamline properties to formalize the inflow jet and impingement zone. We extract a characteristic seeding curve on the ostium, on which an inflow jet boundary contour is constructed. Based on this boundary contour we identify the impingement zone. Furthermore, we present several visualization techniques to depict both characteristics expressively. Thereby, we consider accuracy and robustness of the extracted characteristics, minimal visual clutter and occlusions. An evaluation with six domain experts confirms that our approach detects both hemodynamic characteristics reasonably.","Authors":"Gasteiger, R.;Lehmann, D.J.;van Pelt, R.;Janiga, G.;Beuing, O.;Vilanova, A.;Theisel, H.;Preim, B.","Clusters":"ApplicationsGeneralAndOther;BiomedicalScienceAndMedicine;Engineering;GlyphsGlyphBasedTechniques;","DOI":"10.1109\/TVCG.2012.202","Keywords":"glyph;cerebral aneurysm;visualization;hemodynamics;inflow jet;impingement zone","Keywords_Processed":"visualization;inflow jet;hemodynamic;glyph;cerebral aneurysm;impingement zone","Title":"Automatic Detection and Visualization of Qualitative Hemodynamic Characteristics in Cerebral Aneurysms"},"325":{"Abstract":"Tag clouds have proliferated over the web over the last decade. They provide a visual summary of a collection of texts by visually depicting the tag frequency by font size. In use, tag clouds can evolve as the associated data source changes over time. Interesting discussions around tag clouds often include a series of tag clouds and consider how they evolve over time. However, since tag clouds do not explicitly represent trends or support comparisons, the cognitive demands placed on the person for perceiving trends in multiple tag clouds are high. In this paper, we introduce SparkClouds, which integrate sparklines into a tag cloud to convey trends between multiple tag clouds. We present results from a controlled study that compares SparkClouds with two traditional trend visualizations-multiple line graphs and stacked bar charts-as well as Parallel Tag Clouds. Results show that SparkClouds' ability to show trends compares favourably to the alternative visualizations.","Authors":"Bongshin Lee;Riche, N.H.;Karlson, A.;Carpendale, S.","Clusters":"ChartsDiagramsPlots;EvaluationGeneral;EventsTrendsOutlierDetectionAnalysisAndVisualization;GraphNetworkDataAndTechniques","DOI":"10.1109\/TVCG.2010.194","Keywords":"trend visualization;stacked bar charts;multiple line graphs;tag clouds;evaluation","Keywords_Processed":"trend visualization;stack bar chart;tag cloud;evaluation;multiple line graphs","Title":"SparkClouds: Visualizing Trends in Tag Clouds"},"367":{"Abstract":"In virtual colonoscopy, CT scans are typically acquired with the patient in both supine (facing up) and prone (facing down) positions. The registration of these two scans is desirable so that the user can clarify situations or confirm polyp findings at a location in one scan with the same location in the other, thereby improving polyp detection rates and reducing false positives. However, this supine-prone registration is challenging because of the substantial distortions in the colon shape due to the patient's change in position. We present an efficient algorithm and framework for performing this registration through the use of conformal geometry to guarantee that the registration is a diffeomorphism (a one-to-one and onto mapping). The taeniae coli and colon flexures are automatically extracted for each supine and prone surface, employing the colon geometry. The two colon surfaces are then divided into several segments using the flexures, and each segment is cut along a taenia coli and conformally flattened to the rectangular domain using holomorphic differentials. The mean curvature is color encoded as texture images, from which feature points are automatically detected using graph cut segmentation, mathematic morphological operations, and principal component analysis. Corresponding feature points are found between supine and prone and are used to adjust the conformal flattening to be quasi-conformal, such that the features become aligned. We present multiple methods of visualizing our results, including 2D flattened rendering, corresponding 3D endoluminal views, and rendering of distortion measurements. We demonstrate the efficiency and efficacy of our registration method by illustrating matched views on both the 2D flattened colon images and in the 3D volume rendered colon endoluminal view. We analytically evaluate the correctness of the results by measuring the distance between features on the registered colons.","Authors":"Wei Zeng;Marino, J.;Chaitanya Gurijala, K.;Xianfeng Gu;Kaufman, A.","Clusters":"BiomedicalScienceAndMedicine;DataRegistrationFusionAndIntegration;GeometryBasedTechniques;NumericalMethodsMathematics","DOI":"10.1109\/TVCG.2010.200","Keywords":"data registration;medical visualization;geometry-based technique;mathematical foundations for visualization","Keywords_Processed":"geometry base technique;mathematical foundation for visualization;medical visualization;datum registration","Title":"Supine and Prone Colon Registration Using Quasi-Conformal Mapping"},"317":{"Abstract":"Data visualization is regularly promoted for its ability to reveal stories within data, yet these ÔÇ£data storiesÔÇØ differ in important ways from traditional forms of storytelling. Storytellers, especially online journalists, have increasingly been integrating visualizations into their narratives, in some cases allowing the visualization to function in place of a written story. In this paper, we systematically review the design space of this emerging class of visualizations. Drawing on case studies from news media to visualization research, we identify distinct genres of narrative visualization. We characterize these design differences, together with interactivity and messaging, in terms of the balance between the narrative flow intended by the author (imposed by graphical elements and the interface) and story discovery on the part of the reader (often through interactive exploration). Our framework suggests design strategies for narrative visualization, including promising under-explored approaches to journalistic storytelling and educational media.","Authors":"Segel, E.;Heer, J.","Clusters":"ApplicationsGeneralAndOther;DesignMethodologiesAndInteractionDesign;DesignStudiesAndCaseStudies;SocialNetworksAndSocialMedia;Storytelling","DOI":"10.1109\/TVCG.2010.179","Keywords":"narrative visualization;journalism;case study;storytelling;design methods;social data analysis","Keywords_Processed":"case study;narrative visualization;storytelle;journalism;design method;social datum analysis","Title":"Narrative Visualization: Telling Stories with Data"},"138":{"Abstract":"When and where is an idea dispersed? Social media, like Twitter, has been increasingly used for exchanging information, opinions and emotions about events that are happening across the world. Here we propose a novel visualization design, â€œWhisperâ€\u009d, for tracing the process of information diffusion in social media in real time. Our design highlights three major characteristics of diffusion processes in social media: the temporal trend, social-spatial extent, and community response of a topic of interest. Such social, spatiotemporal processes are conveyed based on a sunflower metaphor whose seeds are often dispersed far away. In Whisper, we summarize the collective responses of communities on a given topic based on how tweets were retweeted by groups of users, through representing the sentiments extracted from the tweets, and tracing the pathways of retweets on a spatial hierarchical layout. We use an efficient flux line-drawing algorithm to trace multiple pathways so the temporal and spatial patterns can be identified even for a bursty event. A focused diffusion series highlights key roles such as opinion leaders in the diffusion process. We demonstrate how our design facilitates the understanding of when and where a piece of information is dispersed and what are the social responses of the crowd, for large-scale events including political campaigns and natural disasters. Initial feedback from domain experts suggests promising use for today's information consumption and dispersion in the wild.","Authors":"Nan Cao;Yu-Ru Lin;Xiaohua Sun;Lazer, D.;Shixia Liu;Huamin Qu","Clusters":"DiffusionRelatedTechniques;SocialNetworksAndSocialMedia;SpatiotemporalDataAndTechniques;","DOI":"10.1109\/TVCG.2012.291","Keywords":"information visualization;contagion;social media;spatio-temporal patterns;microblogging;information diffusion","Keywords_Processed":"information diffusion;information visualization;contagion;spatio temporal pattern;microblogge;social medium","Title":"Whisper: Tracing the Spatiotemporal Process of Information Diffusion in Real Time"},"388":{"Abstract":"Insight Externalization (IE) refers to the process of capturing and recording the semantics of insights in decision making and problem solving. To reduce human effort, Automated Insight Externalization (AIE) is desired. Most existing IE approaches achieve automation by capturing events (e.g., clicks and key presses) or actions (e.g., panning and zooming). In this paper, we propose a novel AIE approach named Click2Annotate. It allows semi-automatic insight annotation that captures low-level analytics task results (e.g., clusters and outliers), which have higher semantic richness and abstraction levels than actions and events. Click2Annotate has two significant benefits. First, it reduces human effort required in IE and generates annotations easy to understand. Second, the rich semantic information encoded in the annotations enables various insight management activities, such as insight browsing and insight retrieval. We present a formal user study that proved this first benefit. We also illustrate the second benefit by presenting the novel insight management activities we developed based on Click2Annotate, namely scented insight browsing and faceted insight search.","Authors":"Yang Chen;Barlowe, S.;Jing Yang","Clusters":"AnalysisProcessGeneral;Labeling;MultidimensionalMultivariateMultifieldDataAndTechniques;ReasoningProblemSolvingAndDecisionMaking;","DOI":"10.1109\/VAST.2010.5652885","Keywords":"annotation;decision making;insight management;multi-dimensional visualization;visual analytics","Keywords_Processed":"multi dimensional visualization;decision make;visual analytic;insight management;annotation","Title":"Click2Annotate: Automated Insight Externalization with rich semantics"},"389":{"Abstract":"This paper highlights the important role that record-keeping (i.e. taking notes and saving charts) plays in collaborative data analysis within the business domain. The discussion of record-keeping is based on observations from a user study in which co-located teams worked on collaborative visual analytics tasks using large interactive wall and tabletop displays. Part of our findings is a collaborative data analysis framework that encompasses note taking as one of the main activities. We observed that record-keeping was a critical activity within the analysis process. Based on our observations, we characterize notes according to their content, scope, and usage, and describe how they fit into a process of collaborative data analysis. We then discuss suggestions for the design of collaborative visual analytics tools.","Authors":"Mahyar, N.;Sarvghad, A.;Tory, M.","Clusters":"CollaborativeVisualization;EvaluationGeneral;LargeAndHighResDisplays;ProvenanceAndHistory;","DOI":"10.1109\/VAST.2010.5652879","Keywords":"wall displays;collaboration;tabletop;note taking;provenance;recording;history","Keywords_Processed":"history;wall display;tabletop;collaboration;note take;recording;provenance","Title":"A closer look at note taking in the co-located collaborative visual analytics process"},"24":{"Abstract":"Visualizing symmetric patterns in the data often helps the domain scientists make important observations and gain insights about the underlying experiment. Detecting symmetry in scalar fields is a nascent area of research and existing methods that detect symmetry are either not robust in the presence of noise or computationally costly. We propose a data structure called the augmented extremum graph and use it to design a novel symmetry detection method based on robust estimation of distances. The augmented extremum graph captures both topological and geometric information of the scalar field and enables robust and computationally efficient detection of symmetry. We apply the proposed method to detect symmetries in cryo-electron microscopy datasets and the experiments demonstrate that the algorithm is capable of detecting symmetry even in the presence of significant noise. We describe novel applications that use the detected symmetry to enhance visualization of scalar field data and facilitate their exploration.","Authors":"Thomas, D.M.;Natarajan, V.","Clusters":"AnalysisProcessGeneral;GraphNetworkDataAndTechniques;ScalarFieldDataTechniques;TopologyBasedTechniques;VisualPatternFeatureDetectionAndTracking","DOI":"10.1109\/TVCG.2013.148","Keywords":"data exploration;scalar field visualization;extremum graph;morse decomposition;symmetry detection","Keywords_Processed":"symmetry detection;morse decomposition;extremum graph;scalar field visualization;datum exploration","Title":"Detecting Symmetry in Scalar fields Using Augmented Extremum Graphs"},"248":{"Abstract":"When visualizing tubular 3D structures, external representations are often used for guidance and display, and such views in 2D can often contain occlusions. Virtual dissection methods have been proposed where the entire 3D structure can be mapped to the 2D plane, though these will lose context by straightening curved sections. We present a new method of creating maps of 3D tubular structures that yield a succinct view while preserving the overall geometric structure. Given a dominant view plane for the structure, its curve skeleton is first projected to a 2D skeleton. This 2D skeleton is adjusted to account for distortions in length, modified to remove intersections, and optimized to preserve the shape of the original 3D skeleton. Based on this shaped 2D skeleton, a boundary for the map of the object is obtained based on a slicing path through the structure and the radius around the skeleton. The sliced structure is conformally mapped to a rectangle and then deformed via harmonic mapping to match the boundary placement. This flattened map preserves the general geometric context of a 3D object in a 2D display, and rendering of this flattened map can be accomplished using volumetric ray casting. We have evaluated our method on real datasets of human colon models.","Authors":"Marino, J.;Wei Zeng;Xianfeng Gu;Kaufman, A.","Clusters":"BiomedicalScienceAndMedicine;GeometryBasedTechniques;NumericalMethodsMathematics;VolumeRenderingModelingAndVisualization","DOI":"10.1109\/TVCG.2011.182","Keywords":"volume rendering;conformal mapping;biomedical visualization;medical visualization;geometry-based technique","Keywords_Processed":"volume render;geometry base technique;biomedical visualization;conformal mapping;medical visualization","Title":"Context Preserving Maps of Tubular Structures"},"134":{"Abstract":"This paper presents two linked empirical studies focused on uncertainty visualization. The experiments are framed from two conceptual perspectives. First, a typology of uncertainty is used to delineate kinds of uncertainty matched with space, time, and attribute components of data. Second, concepts from visual semiotics are applied to characterize the kind of visual signification that is appropriate for representing those different categories of uncertainty. This framework guided the two experiments reported here. The first addresses representation intuitiveness, considering both visual variables and iconicity of representation. The second addresses relative performance of the most intuitive abstract and iconic representations of uncertainty on a map reading task. Combined results suggest initial guidelines for representing uncertainty and discussion focuses on practical applicability of results.","Authors":"MacEachren, A.M.;Roth, R.E.;O'Brien, J.;Li, B.;Swingley, D.;Gahegan, M.","Clusters":"SemanticsSemioticsRelatedTechniques;UncertaintyTechniquesAndVisualization;VisualEncodingAndLayoutGeneral","DOI":"10.1109\/TVCG.2012.279","Keywords":"uncertainty categories;semiotics;visual variables;uncertainty visualization","Keywords_Processed":"semiotic;uncertainty visualization;uncertainty category;visual variable","Title":"Visual Semiotics & Uncertainty Visualization: An Empirical Study"},"226":{"Abstract":"We propose a new framework for visualising tables of counts, proportions and probabilities. We call our framework product plots, alluding to the computation of area as a product of height and width, and the statistical concept of generating a joint distribution from the product of conditional and marginal distributions. The framework, with extensions, is sufficient to encompass over 20 visualisations previously described in fields of statistical graphics and infovis, including bar charts, mosaic plots, treemaps, equal area plots and fluctuation diagrams.","Authors":"Wickham, H.;Hofmann, H.","Clusters":"ChartsDiagramsPlots;HierarchicalTreeDataAndTechniques;MachineLearningAndStatistics","DOI":"10.1109\/TVCG.2011.227","Keywords":"mosaic plots;conditional distribution;bar chart;treemap;joint distribution;statistics","Keywords_Processed":"treemap;conditional distribution;bar chart;statistic;mosaic plot;joint distribution","Title":"Product Plots"},"23":{"Abstract":"We present an interface for exploring large design spaces as encountered in simulation-based engineering, design of visual effects, and other tasks that require tuning parameters of computationally-intensive simulations and visually evaluating results. The goal is to enable a style of design with simulations that feels as-direct-as-possible so users can concentrate on creative design tasks. The approach integrates forward design via direct manipulation of simulation inputs (e.g., geometric properties, applied forces) in the same visual space with inverse design via 'tugging' and reshaping simulation outputs (e.g., scalar fields from finite element analysis (FEA) or computational fluid dynamics (CFD)). The interface includes algorithms for interpreting the intent of users' drag operations relative to parameterized models, morphing arbitrary scalar fields output from FEA and CFD simulations, and in-place interactive ensemble visualization. The inverse design strategy can be extended to use multi-touch input in combination with an as-rigid-as-possible shape manipulation to support rich visual queries. The potential of this new design approach is confirmed via two applications: medical device engineering of a vacuum-assisted biopsy device and visual effects design using a physically based flame simulation.","Authors":"Coffey, D.;Chi-Lun Lin;Erdman, A.G.;Keefe, D.F.","Clusters":"InteractionTechniquesGeneral;Simulation;VisualDesignDesignGuidelines","DOI":"10.1109\/TVCG.2013.147","Keywords":"multi-touch;design;simulation;direct manipulation","Keywords_Processed":"multi touch;direct manipulation;simulation;design","Title":"Design by Dragging: An Interface for Creative Forward and Inverse Design with Simulation Ensembles"}}